Masmiseim36/nxpSDK/devices/MKV42F16/drivers/fsl_cadc.c
/*
 * Mask table for channel differential pair setting.
 * The item's value would be set into ADC_CTRL1[CHNCFG_L] or ADC_CTRL2[CHNCFG_H].
 */
static const uint16_t g_CADCChannelConfigDifferentialMask[] = {
    0x0010, /* CHN0-1,   ANA0-ANA1, ADC_CTRL1[CHNCFG_L]. */
    0x0020, /* CHN2-3,   ANA2-ANA3. ADC_CTRL1[CHNCFG_L]. */
    0x0080, /* CHN4-5,   ANA4-ANA5. ADC_CTRL2[CHNCFG_H]. */
    0x0100, /* CHN6-7,   ANA6-ANA7. ADC_CTRL2[CHNCFG_H]. */
    0x0040, /* CHN8-9,   ANB0-ANB1. ADC_CTRL1[CHNCFG_L]. */
    0x0080, /* CHN10-11, ANB2-ANB3. ADC_CTRL1[CHNCFG_L]. */
    0x0200, /* CHN12-13, ANB4-ANB5. ADC_CTRL2[CHNCFG_H]. */
    0x0400  /* CHN14-15, ANB6-ANB7. ADC_CTRL2[CHNCFG_H]. */
};

/*!
 * brief Configures the sample slot.
 *
 * param base        CADC peripheral base address.
 * param sampleIndex Index of sample slot in conversion sequence. Available range is 0-15.
 * param config      Pointer to configuration structure. See "cadc_sample_config_t"
 */
void CADC_SetSampleConfig(ADC_Type *base, uint16_t sampleIndex, const cadc_sample_config_t *config)
{
    assert(NULL != config);
    assert(sampleIndex < ADC_RSLT_COUNT);

    uint16_t tmp16;

    /* Configure the differential conversion channel. */
    if ((config->channelNumber < 4U) || ((config->channelNumber >= 8U) && (config->channelNumber < 12U)))
    {
        if (config->enableDifferentialPair)
        {
            base->CTRL1 |= g_CADCChannelConfigDifferentialMask[config->channelNumber / 2U];
        }
        else
        {
            base->CTRL1 &= (uint16_t)(~g_CADCChannelConfigDifferentialMask[config->channelNumber / 2U]);
        }
    }
    else if (((config->channelNumber >= 4U) && (config->channelNumber < 8U)) ||
             ((config->channelNumber >= 12U) && (config->channelNumber < 16U)))
    {
        if (config->enableDifferentialPair)
        {
            base->CTRL2 |= g_CADCChannelConfigDifferentialMask[config->channelNumber / 2U];
        }
        else
        {
            base->CTRL2 &= (uint16_t)(~g_CADCChannelConfigDifferentialMask[config->channelNumber / 2U]);
        }
    }
    else
    {
        /* To avoid MISRA rule 14.10 error. */
    }

    /* Configure the zero crossing mode. */
    if (sampleIndex < 8U)
    {
        tmp16 = base->ZXCTRL1 & (uint16_t)(~ADC_ZXCTRL_ZCE_MASK(sampleIndex));
        tmp16 |= ADC_ZXCTRL_ZCE(sampleIndex, config->zeroCrossingMode);
        base->ZXCTRL1 = tmp16;
    }
    else if (sampleIndex < 16U)
    {
        sampleIndex -= 8U;
        tmp16 = base->ZXCTRL2 & (uint16_t)(~ADC_ZXCTRL_ZCE_MASK(sampleIndex));
        tmp16 |= ADC_ZXCTRL_ZCE(sampleIndex, config->zeroCrossingMode);
        base->ZXCTRL2 = tmp16;
        sampleIndex += 8U;
    }
    else
    {
        /* To avoid MISRA rule 14.10 error. */
    }

    /* Fill the conversion channel into sample slot. */
    if (sampleIndex < 4U)
    {
        tmp16 = base->CLIST1 & (uint16_t)(~ADC_CLIST_SAMPLE_MASK(sampleIndex));
        tmp16 |= ADC_CLIST_SAMPLE(sampleIndex, config->channelNumber);
        base->CLIST1 = tmp16;
    }
    else if (sampleIndex < 8U)
    {
        sampleIndex -= 4U;
        tmp16 = base->CLIST2 & (uint16_t)(~ADC_CLIST_SAMPLE_MASK(sampleIndex));
        tmp16 |= ADC_CLIST_SAMPLE(sampleIndex, config->channelNumber);
        base->CLIST2 = tmp16;
        sampleIndex += 4U;
    }
    else if (sampleIndex < 12U)
    {
        sampleIndex -= 8U;
        tmp16 = base->CLIST3 & (uint16_t)(~ADC_CLIST_SAMPLE_MASK(sampleIndex));
        tmp16 |= ADC_CLIST_SAMPLE(sampleIndex, config->channelNumber);
        base->CLIST3 = tmp16;
        sampleIndex += 8U;
    }
    else if (sampleIndex < 16U)
    {
        sampleIndex -= 12U;
        tmp16 = base->CLIST4 & (uint16_t)(~ADC_CLIST_SAMPLE_MASK(sampleIndex));
        tmp16 |= ADC_CLIST_SAMPLE(sampleIndex, config->channelNumber);
        base->CLIST4 = tmp16;
        sampleIndex += 12U;
    }
    else
    {
        /* To avoid MISRA rule 14.10 error. */
    }

    /* Configure the hardware comapre. */
    base->LOLIM[sampleIndex] = config->lowLimitValue;
    base->HILIM[sampleIndex] = config->highLimitValue;
    base->OFFST[sampleIndex] = config->offsetValue;

    /* Configure the gain for channel. */
    if (config->channelNumber < 8U)
    {
        tmp16 = base->GC1 & (uint16_t)(~ADC_GC_GAIN_MASK(config->channelNumber));
        tmp16 |= ADC_GC_GAIN(config->channelNumber, (uint16_t)(config->channelGain));
        base->GC1 = tmp16;
    }
    else if (config->channelNumber < 16U)
    {
        tmp16 = base->GC2 & (uint16_t)(~ADC_GC_GAIN_MASK(config->channelNumber - 8U));
        tmp16 |= ADC_GC_GAIN(config->channelNumber - 8U, (uint16_t)(config->channelGain));
        base->GC2 = tmp16;
    }
    else
    {
        /* To avoid MISRA rule 14.10 error. */
    }

    /* Configure the hardware trigger. */
    /* ADC_SCTRL. */
    if (config->enableWaitSync)
    {
        base->SCTRL |= (uint16_t)(1UL << sampleIndex);
    }
    else
    {
        base->SCTRL &= ~(uint16_t)(1UL << sampleIndex);
    }
}
